{
  "rockets": [
    {
      "rocket": "Falcon Heavy",
      "description": "Falcon Heavy is a partially reusable heavy-lift launch vehicle designed and manufactured by SpaceX. It is derived from the Falcon 9 vehicle and consists of a strengthened Falcon 9 first stage as the center core with two additional Falcon 9-like first stages as strap-on boosters.",
      "company": "SpaceX",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 63800,
      "payloadGTO": 26700,
      "pricePerKg": 1411,
      "pricePerLaunch": 90000000,
      "image": "https://i.ibb.co/Xy4fJLY/Png-Item-6482399.png",
      "id": 1
    },
    {
      "rocket": "Falcon 9",
      "description": "Falcon 9 is a partially reusable two-stage-to-orbit medium-lift launch vehicle designed and manufactured by SpaceX in the United States. The latest version of the first stage can return to Earth and be flown again multiple times. ",
      "company": "SpaceX",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 22800,
      "payloadGTO": 8300,
      "pricePerKg": 2720,
      "pricePerLaunch": 62000000,
      "image": "https://i.ibb.co/N3wXK8z/falcon-9.png",
      "id": 2
    },
    {
      "rocket": "Starship Superheavy",
      "description": "SpaceX’s Starship spacecraft and Super Heavy rocket (collectively referred to as Starship) represent a fully reusable transportation system designed to carry both crew and cargo to Earth orbit, the Moon, Mars and beyond. Starship will be the world’s most powerful launch vehicle ever developed, with the ability to carry in excess of 100 metric tonnes to Earth orbit.",
      "company": "SpaceX",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 100000,
      "payloadGTO": 21000,
      "pricePerKg": 100,
      "pricePerLaunch": 10000000,
      "image": "https://i.ibb.co/jwZ7v66/Starship.png",
      "id": 3
    },
    {
      "rocket": "Delta IV Heavy",
      "description": "The Delta IV Heavy is an expendable heavy-lift launch vehicle, the largest type of the Delta IV family. It is the world's second highest-capacity launch vehicle in operation, behind SpaceX's Falcon Heavy, and closely followed by CNSA's Long March 5.",
      "company": "ULA",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 28000,
      "payloadGTO": 13000,
      "pricePerKg": 15700,
      "pricePerLaunch": 440000000,
      "image": "https://i.ibb.co/QkK4RcP/delta-iv-heavy.png",
      "id": 6
    },
    {
      "rocket": "Proton M",
      "description": "The Proton-M, GRAU index 8K82M or 8K82KM, is an expendable Russian heavy-lift launch vehicle derived from the Soviet-developed Proton. It is built by Khrunichev, and launched from sites 81 and 200 at the Baikonur Cosmodrome in Kazakhstan.",
      "company": "RosCosmos",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 23700,
      "payloadGTO": 6300,
      "pricePerKg": 2826,
      "pricePerLaunch": 65000000,
      "image": "https://i.ibb.co/jJS3R1D/proton-m.png",
      "id": 4
    },
    {
      "rocket": "Atlas V",
      "description": "Atlas V is an expendable launch system and the fifth major version in the Atlas rocket family. It was originally designed by Lockheed Martin, now being operated by United Launch Alliance, a joint venture between Lockheed Martin and Boeing. Atlas V is also a major NASA launch vehicle.",
      "company": "ULA",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 18500,
      "payloadGTO": 8700,
      "pricePerKg": 9167,
      "pricePerLaunch": 153000000,
      "image": "https://i.ibb.co/cTTh9b7/atlas5.png",
      "id": 5
    },
    {
      "rocket": "Electron",
      "description": "Electron is a two-stage, partially recoverable orbital launch vehicle developed by Rocket Lab, an American aerospace company with a wholly owned New Zealand subsidiary. Electron was developed to service the commercial small satellite launch market",
      "company": "Rocket Lab",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 300,
      "payloadGTO": 0,
      "pricePerKg": 25000,
      "pricePerLaunch": 7500000,
      "image": "https://i.ibb.co/6bJVp9H/electron.png",
      "id": 7
    },
    {
      "rocket": "Space Shuttle",
      "description": "The Space Shuttle is a partially reusable low Earth orbital spacecraft system operated by the U.S. National Aeronautics and Space Administration (NASA) as part of the Space Shuttle program. ",
      "company": "NASA",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 27000,
      "payloadGTO": 0,
      "pricePerKg": 54500,
      "pricePerLaunch": 1500000000,
      "image": "https://i.ibb.co/bLc314h/shuttle.png",
      "id": 16
    },
    {
      "rocket": "Firefly Alpha",
      "description": "Firefly Alpha is a two-stage orbital expendable launch vehicle developed by the American aerospace company Firefly Aerospace to cover the commercial small satellite launch market. Alpha is intended to provide launch options for both full vehicle and ride share customers. ",
      "company": "Firefly Aerospace",
      "payloadLEO": 630,
      "payloadGTO": 0,
      "pricePerKg": 23800,
      "pricePerLaunch": 15000000,
      "image": "https://i.ibb.co/JmhHjmR/firefly-Alpha.png",
      "id": 8
    },
    {
      "rocket": "Long March 5",
      "description": "Long March 5 is a heavy-lift launch vehicle developed by the China Academy of Launch Vehicle Technology (CALT). It is the first Chinese launch vehicle designed to use exclusively non-hypergolic liquid propellants. It is the fifth iteration of the Long March rocket family, named for the Chinese Red Army's 1934–35 Long March, during the Chinese Civil War.",
      "company": "CALT",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 25000,
      "payloadGTO": 14000,
      "pricePerKg": 6000,
      "pricePerLaunch": 150000000,
      "image": "https://i.ibb.co/hgPTZjj/long-March5.png",
      "id": 9
    },
    {
      "rocket": "Long March 6",
      "description": "The Long March 6 or Chang Zheng 6 as in pinyin, abbreviated LM 6 for export or CZ 6 within China, is a Chinese liquid-fuelled launch vehicle of the Long March family, which was developed by the China Aerospace Science and Technology Corporation and the Shanghai Academy of Spaceflight Technology.",
      "company": "CALT",
      "LEO": true,
      "GTO": false,
      "payloadLEO": 1500,
      "payloadGTO": 0,
      "pricePerKg": 8600,
      "pricePerLaunch": 13000000,
      "image": "https://i.ibb.co/G9wZnMw/long-March-6a.png",
      "id": 10
    },
    {
      "rocket": "Energia",
      "description": "Energia is a super-heavy lift launch vehicle. It was designed by NPO Energia of the Soviet Union for a variety of payloads including the Buran spacecraft. Control system main developer enterprise was the Khartron NPO Electropribor.",
      "company": "Roscosmos",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 100000,
      "payloadGTO": 22000,
      "pricePerKg": 7600,
      "pricePerLaunch": 764000000,
      "image": "https://i.ibb.co/pwsHcr7/energia.png",
      "id": 11
    },
    {
      "rocket": "N1",
      "description": "The N1/L3 is a super heavy-lift launch vehicle initially intended to deliver payloads beyond low Earth orbit. The N1 was the Soviet counterpart to the US Saturn V and was intended to enable crewed travel to Earth's Moon and beyond, with studies beginning as early as 1959. Its first stage remains one of the most powerful rocket stages ever built, surpassed only by the SpaceX Super Heavy first stage in 2021.",
      "company": "Roscosmos",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 95000,
      "payloadGTO": 23000,
      "pricePerKg": 6300,
      "pricePerLaunch": 604000000,
      "image": "https://i.ibb.co/zx1k7HX/n1.png",
      "id": 12
    },
    {
      "rocket": "New Glenn",
      "description": "New Glenn, named after NASA astronaut John Glenn, is a heavy-lift orbital launch vehicle in development by Blue Origin. Design work on the vehicle began in 2012. Illustrations of the vehicle, and the high-level specifications, were initially publicly unveiled in September 2016.",
      "company": "Blue Origin",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 45000,
      "payloadGTO": 13600,
      "pricePerKg": 5000,
      "pricePerLaunch": 130000000,
      "image": "https://i.ibb.co/txyKVJr/New-Glenn.png",
      "id": 13
    },
    {
      "rocket": "Soyuz 2",
      "description": "Soyuz 2 is a modernised version of the Soviet Soyuz rocket. In its basic form, it is a three-stage launch vehicle for placing payloads into low Earth orbit. Compared to the previous versions of the Soyuz, the first-stage boosters and two core stages feature uprated engines with improved injection systems.",
      "company": "Roscosmos",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 8200,
      "payloadGTO": 3200,
      "pricePerKg": 6650,
      "pricePerLaunch": 54600000,
      "image": "https://i.ibb.co/BVHngwp/soyuz.png",
      "id": 14
    },
    {
      "rocket": "H3",
      "description": "The H3 Launch Vehicle is an expendable launch system in development in Japan. H3 rockets are liquid-propellant rockets with strap-on solid rocket boosters and are planned to be launched from Tanegashima Space Center in Japan. Mitsubishi and JAXA are responsible for the design, manufacture, and operation of the H3.",
      "company": "JAXA",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 16000,
      "payloadGTO": 8000,
      "pricePerKg": 3700,
      "pricePerLaunch": 60000000,
      "image": "https://i.ibb.co/ygTVXfg/H3-Rocket.png",
      "id": 15
    },
    {
      "rocket": "",
      "description": "",
      "company": "",
      "LEO": true,
      "GTO": true,
      "payloadLEO": 0,
      "payloadGTO": 0,
      "pricePerKg": 0,
      "pricePerLaunch": 0,
      "image": "",
      "id": 18
    }
  ]
}